Ran Plan for 2 projects:

1. dir: `EKS/Cluster` workspace: `default`
1. dir: `EKS/VPC` workspace: `default`
---

### 1. dir: `EKS/Cluster` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_eks_cluster.my_cluster will be created
+ resource "aws_eks_cluster" "my_cluster" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "martinus-eks-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "martinus-eks-cluster"
          + "Owner"       = "infrastructure-team"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/cluster"
        }
      + tags_all              = {
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "martinus-eks-cluster"
          + "Owner"       = "infrastructure-team"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/cluster"
        }
      + version               = (known after apply)

      + access_config (known after apply)

      + kubernetes_network_config (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + subnet_ids                = [
              + "subnet-087efb745876fa202",
              + "subnet-0c0f72c6359ad6085",
              + "subnet-0fe65694cdabca319",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.my_node_group will be created
+ resource "aws_eks_node_group" "my_node_group" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "martinus-eks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "node-group-1"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-087efb745876fa202",
          + "subnet-0c0f72c6359ad6085",
          + "subnet-0fe65694cdabca319",
        ]
      + tags                   = {
          + "Name" = "node-group-1"
        }
      + tags_all               = {
          + "Name" = "node-group-1"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + update_config (known after apply)
    }

  # aws_iam_role.eks_cluster_role will be created
+ resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.eks_node_group_role will be created
+ resource "aws_iam_role" "eks_node_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.eks_node_role will be created
+ resource "aws_iam_role" "eks_node_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.eks_cluster_policy_attachment will be created
+ resource "aws_iam_role_policy_attachment" "eks_cluster_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # aws_iam_role_policy_attachment.eks_cni_policy_attachment will be created
+ resource "aws_iam_role_policy_attachment" "eks_cni_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.eks_ecr_policy_attachment will be created
+ resource "aws_iam_role_policy_attachment" "eks_ecr_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-group-role"
    }

  # aws_iam_role_policy_attachment.eks_node_group_policy_attachment will be created
+ resource "aws_iam_role_policy_attachment" "eks_node_group_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-group-role"
    }

  # aws_security_group.eks_cluster_sg will be created
+ resource "aws_security_group" "eks_cluster_sg" {
      + arn                    = (known after apply)
      + description            = "Security group for the EKS cluster"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "eks-cluster-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0ca2d1fea23bcd3a9"
    }

  # aws_security_group_rule.eks_cluster_egress will be created
+ resource "aws_security_group_rule" "eks_cluster_egress" {
      + cidr_blocks              = [
          + "27.131.250.11/32",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # aws_security_group_rule.eks_cluster_ingress will be created
+ resource "aws_security_group_rule" "eks_cluster_ingress" {
      + cidr_blocks              = [
          + "27.131.250.11/32",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ eks_cluster_arn            = (known after apply)
+ eks_cluster_endpoint       = (known after apply)
+ eks_cluster_name           = "martinus-eks-cluster"
+ eks_cluster_role_arn       = (known after apply)
+ eks_cluster_security_group = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d EKS/Cluster
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252FEKS%252FCluster%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d EKS/Cluster
  ```
Plan: 12 to add, 0 to change, 0 to destroy.

---
### 2. dir: `EKS/VPC` workspace: `default`
<details><summary>Show Output</summary>

```diff
data.aws_availability_zones.available: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=ap-southeast-1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_internet_gateway.gw will be created
+ resource "aws_internet_gateway" "gw" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Main-IGW"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Main-IGW"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.public will be created
+ resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Route-Table"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all         = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Route-Table"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public[0] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[1] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public[2] will be created
+ resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.private[0] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-0"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-0"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[1] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-1"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-1"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.private[2] will be created
+ resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-2"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Private-Subnet-2"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[0] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-0"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-0"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[1] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-1"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-1"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public[2] will be created
+ resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-southeast-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-2"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                                       = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "Public-Subnet-2"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.eks_vpc will be created
+ resource "aws_vpc" "eks_vpc" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = (known after apply)
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "EKS-VPC"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
      + tags_all                             = {
          + "Attributes"  = "vpc"
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "EKS-VPC"
          + "Owner"       = "team-sre"
          + "TFProject"   = "github.com/tampubolon/data-pipeline/eks/vpc"
        }
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ igw_id              = (known after apply)
+ private_subnet_0_id = (known after apply)
+ private_subnet_1_id = (known after apply)
+ private_subnet_2_id = (known after apply)
+ public_subnet_0_id  = (known after apply)
+ public_subnet_1_id  = (known after apply)
+ public_subnet_2_id  = (known after apply)
+ vpc_cidr            = "10.0.0.0/16"
+ vpc_id              = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d EKS/VPC
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252FEKS%252FVPC%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d EKS/VPC
  ```
Plan: 12 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 2 with changes, 0 with no changes, 0 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```